app/Controllers/Agama.php

    public function getagama()
    {
        if ($this->request->isAJAX()) {
            $data = [
                'title' => 'agama - Berita',
                'list' => $this->agama->orderBy('agama_id', 'ASC')->findAll()
---
SELECT *
FROM `agama`
ORDER BY `agama_id` ASC